// Лабораторная работа №6

open System

[<EntryPoint>]
let main argv =
    printfn "Лабораторная работа №6"

    // Задание 
    printfn "Разработайте программу, которая осуществляет разбор текста с использованием библиотеки FParsec. Результатом разбора должны быть значения алгебраического типа."

    // Разбор текста в алгебаические типы

    // ...

    //|> ignore - перенаправление потока с игнорирование результата вычисления
    Console.ReadLine() |> ignore
    0 // возвращение целочисленного кода выхода